[
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "slack has an export feature. i've exported our slack history and placed it here: <https:\/\/github.com\/dattnetwork\/dattslack>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "dattnetwork\/dattslack",
                "title_link": "https:\/\/github.com\/dattnetwork\/dattslack",
                "text": "dattslack - Slack all the things.",
                "fallback": "GitHub: dattnetwork\/dattslack",
                "thumb_url": "https:\/\/avatars0.githubusercontent.com\/u\/13266895?v=3&s=400",
                "from_url": "https:\/\/github.com\/dattnetwork\/dattslack",
                "thumb_width": 214,
                "thumb_height": 214,
                "id": 1
            }
        ],
        "ts": "1438498892.003030"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "will do so at the end of tomorrow as well. IMO we should regard slack as being temporary and intend to host all content in more permanent places. the dattdocs repo is designed to hold general content permanently, either as text or as links to other documents\/files: <https:\/\/github.com\/dattnetwork\/dattdocs>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "dattnetwork\/dattdocs",
                "title_link": "https:\/\/github.com\/dattnetwork\/dattdocs",
                "text": "dattdocs - Document all the things.",
                "fallback": "GitHub: dattnetwork\/dattdocs",
                "thumb_url": "https:\/\/avatars0.githubusercontent.com\/u\/13266895?v=3&s=400",
                "from_url": "https:\/\/github.com\/dattnetwork\/dattdocs",
                "thumb_width": 214,
                "thumb_height": 214,
                "id": 1
            }
        ],
        "ts": "1438498957.003032"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i'll rename \"Slack all the things\" to \"Discuss all the things\"",
        "ts": "1438499000.003034"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "so we spent a bunch of time talking about how the product should work at the SF meetup",
        "ts": "1438499047.003035"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "<@U08BY8MGV> put together a great mockup of what the simplest possible solution might look like, along with a business plan",
        "ts": "1438499073.003036"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "his idea (IIRC) is that upvotes and downvotes both cost money. when you upvote, you pay the user, but a share goes to the moderators and hosts. in the simplest version, the node and moderator are the same, so when you upvote something, the user gets most value, but the moderator also gets some (5%). the moderator can also share some for the host (which is the same in v1).",
        "ts": "1438499141.003037"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "we spent a bunch of time talking about the meaning of a downvote",
        "ts": "1438499149.003038"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "who gets the money for a downvote? perhaps the content producer does ... this seems counterintuitive, because they are being downvoted .. why should they get paid? but the rationale is that it should still cost money to downvote, and there was no other more appropriate person to get the money. we discussed that it could go to the moderators, or hosts, or a lottery system, or burn the money, or lock the funds. none seemed really satisfactory.",
        "ts": "1438499217.003039"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "we also paid attention to how reddit gold works, because reddit gold might be more analagous to what we're doing than upvoting\/downvoting",
        "ts": "1438499263.003040"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "when you 'gild' someone on reddit, the content producer gets an icon and ads removed, but doesn't get any money. reddit gets all $5 or whatever it costs to gild someone. reddit also gets money when a user buys gold for themselves. this is HALF of reddit's revenue. a huge amount. $650,000 per month.",
        "ts": "1438499306.003041"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "perhaps what users on datt are doing is actually 'gilding' each other, except the content producer gets the money instead of the company",
        "ts": "1438499332.003042"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "but perhaps the moderators\/hosts also get a cut, and therein lies the business model. if executed correctly, where we don't pick arbitrary percentages, but allow the moderators and users and hosts to set the percentages, a market develops for the best content.",
        "ts": "1438499374.003043"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "that's about all i remember about our conversation. i think brad's ideas are very solid and probably the best worked out business plan i've read... although i haven't thoroughly considered paul's work (and are there others i'm missing?)",
        "ts": "1438499443.003044"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I think rewarding submitters for getting down voted is a very very bad idea",
        "ts": "1438502553.003045"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "<@U07GDL0H5>: I haven't really compiled a business plan in the same sense as <@U08BY8MGV>'s spreadsheet. I was still focused on some unique incentive allocation between authors and peers. <@U08EZP01H> &amp; <@U08E5P0BZ> also chimed in with some great ideas around 'subscriptions' in <#C08FM0F6G>",
        "ts": "1438502559.003046"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "ha yeah we had people on both sides of the argument, <@U08DD8LNP>",
        "ts": "1438502570.003047"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "what purpose does a downvote need to effect on the network?",
        "ts": "1438502591.003048"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08ERPTQF>: IMO it should cost something and be visible to others",
        "ts": "1438502607.003049"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "and not reward the person getting down voted, it could reward pretty much anyone else or nobody at all.  if you reward people for getting down voted they will troll harder than they will otherwise",
        "ts": "1438502646.003050"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "there is the argument that a downvote signals that content won't be propagated by a peer which makes sense, but is a downvote meant to serve any other purpose?",
        "ts": "1438502700.003051"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "gold1fish, and if it costs something, who should get the bitcoin?",
        "ts": "1438502710.003052"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08ERPTQF>: it's a distributed form of moderation primarily",
        "ts": "1438502726.003053"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U07GDL0H5>: that's why I lean towards burns, you can determine the address deterministically and keep things simple, and the psychological barrier will keep down voting in check",
        "ts": "1438502759.003054"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "also seems quite memeworthy, burning content is way cooler than down voting it",
        "ts": "1438502773.003055"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "We don't have censorship, but we can burn content =D",
        "ts": "1438502781.003056"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "actually burning is not a bad idea. howabout this bold idea... maybe create a transaction paying everything to miner fees?",
        "ts": "1438502798.003057"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "rather than permanently destroying bitcoin, at least the bitcoin doesn't go away",
        "ts": "1438502808.003058"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "that could work as well same result as far as we're concerned",
        "ts": "1438502816.003059"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "we somehow didn't actually consider that option in our conversation",
        "ts": "1438502828.003060"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "again a lot of my thoughts center around using something not quite as deflationary as bitcoin so burning isn't as big of a deal in something like reddcoin or sjwcoin",
        "ts": "1438502843.003061"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "and in the same transaction, you create an OP_RETURN output that says \"OP SUCKS!!\"",
        "ts": "1438502853.003062"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "I like the visual of burning content",
        "ts": "1438502854.003063"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i think we have everything to gain from leveraging bitcoin ... it has by far the strongest network effect and most utility outside the network",
        "ts": "1438502915.003064"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "also like the idea that downvotes are paid to miner fees as this pays some dues to the blockchain we are transacting on.",
        "ts": "1438502931.003065"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I am all for the network effect by biggest fear with bitcoin is prohibitorily high fees and dust limits",
        "ts": "1438502942.003066"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "have you looked into the lightning network? if we implement that, transaction fees should be next to 0",
        "ts": "1438502961.003067"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "conceivably we could support multiple coins. perhaps you pay in whatever you want.",
        "ts": "1438502999.003068"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I need to take a dive into that, I have heard of it but not read a lot about it yet if we can get micropayments working well then that would address that concern but I am talking like very micro payments",
        "ts": "1438503000.003069"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "lightning on elements is only alpha but it's ready to develop on if we start with testnet coins",
        "ts": "1438503003.003070"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "paul_xbt: awesome, i didn't realize it was even that well developed. if so, we could really leverage that code and basically convert to javascript.",
        "ts": "1438503032.003071"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "user participation at an individual level should be so cheap that it feels like nothing to vote on something in a 'standard' way but you could of course make it rain with a gild style super upvote of coin as well",
        "ts": "1438503032.003072"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "IMO a standard upvote should be something like ~100 bits if that",
        "ts": "1438503080.003073"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "because if the costs get too high it will have too much of a chilling effect on participation and be a too big of a barrier to entry for people who are used to getting that experience \"for free\"",
        "ts": "1438503135.003074"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "<@U07GDL0H5>: yea it got a big boost when the elements team started contributing directly to lightning <https:\/\/github.com\/ElementsProject\/lightning>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "ElementsProject\/lightning",
                "title_link": "https:\/\/github.com\/ElementsProject\/lightning",
                "text": "lightning - Lightning network",
                "fallback": "GitHub: ElementsProject\/lightning",
                "thumb_url": "https:\/\/avatars0.githubusercontent.com\/u\/12729539?v=3&s=400",
                "from_url": "https:\/\/github.com\/ElementsProject\/lightning",
                "thumb_width": 420,
                "thumb_height": 420,
                "id": 1
            }
        ],
        "ts": "1438503159.003075"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "what we have to harp on is that the reddit experience isn't really free, they are the product and the ad space and top-down content manipulations are the costs.  basically <http:\/\/go1dfish.me\/blog\/my-two-cents-there-aint-no-such-thing-as-free-speech>",
        "ts": "1438503191.003077"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "what's the best intro thing to read for lighting?",
        "ts": "1438503208.003078"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "well they have a whitepaper, but it's really really long",
        "ts": "1438503238.003079"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "<http:\/\/lightning.network>",
        "ts": "1438503242.003080"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "I would say the original lightning whitepaper, but there's an edit in progress to actually simplify things",
        "ts": "1438503263.003081"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "there are also some talks, probably with recordings on youtube",
        "ts": "1438503265.003082"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "whitepapers are good that’s pretty much what I was expecting",
        "ts": "1438503326.003083"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "my google fu is failing to turn up the paper that recommended some simplifications",
        "ts": "1438503373.003084"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "first impression from the abstract is wont this introduce a large delay in vote propagation?",
        "ts": "1438503374.003085"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "no, you can prove that a payment occurred, i believe",
        "ts": "1438503394.003086"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "one way is with OP_RETURN data, you could hash the content you are upvoting, and XOR it with the content already in the OP_RETURN, and show before and after, which is then signed",
        "ts": "1438503434.003087"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "eventually a tx gets in the blockchain that is an XOR of all the content upvoted",
        "ts": "1438503450.003088"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i think that would work",
        "ts": "1438503470.003089"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "for any individual vote yeah but wont it slow down the totaling of votes? seems like it would be harder to determine the current score of a thing that way",
        "ts": "1438503506.003090"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i think the \"proof verification\" could occur in a delayed manner, i.e. nodes relay an untrusted value that is immediately displayed, then if during the proof check, it is discovered to be invalid, the updated value is displayed",
        "ts": "1438503549.003091"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "if we are working on eventual consistency, then yes a node may not be aware of the total votes at a given time, but they should have a fair idea",
        "ts": "1438503574.003092"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "yeah",
        "ts": "1438503581.003093"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "worth noting that reddit actually does that ... the karma you see is actually not the most recent, correct value",
        "ts": "1438503597.003094"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "problem is at least as it relates to the reddit algorithms the early time of a submission is the most important for voting\/exposure.  and yeah I’m sure reddit does the same sorts of eventual consistency but on smaller time scales I would think",
        "ts": "1438503648.003095"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "also note that if you discover that someone has committed vote fraud in a delayed way, you can punish them by publishing a proof of the fraud ... and that can damage their reputation ... so people are disencentived from committing fraud, even if it isn't discovered until later",
        "ts": "1438503733.003096"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "not a perfect solution",
        "ts": "1438503737.003097"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "considering that if votes are just coin transactions and they can come from anywhere...",
        "ts": "1438503761.003098"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "reputation isn’t going to matter much in that sort of scenario",
        "ts": "1438503768.003099"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "unless we have clients that weigh votes from known identities in a stronger way, which is already something I think could be beneficial",
        "ts": "1438503790.003100"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "well they should be attached to the user's identitity, so you know who voted. doesn't have to be that way, but helps to ensure that no vote fraud occurs.",
        "ts": "1438503808.003101"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "yeah i think weighing votes from known identities higher is totally valid",
        "ts": "1438503827.003102"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I think we ought to incorporate both, you can vote anonymously",
        "ts": "1438503835.003103"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "if all your friends upvoted something, why not display it more prominantly?",
        "ts": "1438503844.003104"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "but clients are able to weight things in whatever way serves their interests",
        "ts": "1438503848.003105"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "yeah totally, you could have a setup where a collective maintained a listing of approved voters even",
        "ts": "1438503871.003106"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "of course you can always vote anonymously ... create a new identity, send bitcoin with it",
        "ts": "1438503876.003107"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "and have the client setup to ignore everyone else, and then turn around and view the same set of content with all the votes enabled and get a totally different experience",
        "ts": "1438503894.003108"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "that’s one of the big complaints a lot of reddit communities have RE: brigading, the idea that anyone can come in and vote on their stuff counter to the community",
        "ts": "1438503995.003109"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "with this approach that can still happen; but you also have the ability to make it effectively go away.  and if you know the content is primarily for a given collective that operates that way it would reduce your incentive to mess their stuff up that way in the first place",
        "ts": "1438504048.003110"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "I think instead of a burn we should pay downvotes to a fund that get paid periodically to the highest ranking content.",
        "ts": "1438504150.003111"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "if someone gets really hard into unique identity verification tied to crypto keys then you could even start doing some transparent democracy 2.0 type stuff with this but secret ballots would be tough to do without more indirection.",
        "ts": "1438504155.003112"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08E5P0BZ>: ideally those are already gonna get paid in upvotes, if you want to do something like that I think it makes more sense to distribute it more widely to people who vote on content but may not submit much",
        "ts": "1438504196.003113"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "because if voters never get anything back they will stop voting, and voting is important to keep content well sorted",
        "ts": "1438504217.003114"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "that works too, like the early upvoters",
        "ts": "1438504220.003115"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I don’t know how you would administer it that way, but in theory yeah that could be a good model",
        "ts": "1438504244.003116"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "just seems a shame to make some one part with money and then burn it.  I don't think that will be easy to explain.",
        "ts": "1438504246.003117"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "your content sucks so bad I’m willing to burn money rather than give it to you just to show you how bad it sucks",
        "ts": "1438504282.003118"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "lol",
        "ts": "1438504288.003119"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "we discussed a lottery. maybe you randomly pay someone else's content.",
        "ts": "1438504298.003120"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "i think giving it to a better cause is a no brainer",
        "ts": "1438504308.003121"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "if they wouldn’t throw me in jail for it I’d much rather burn my money than give it to the IRS for example",
        "ts": "1438504313.003122"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "i get that.  but you'd probably rather give it to your favorite crypto anarchists.",
        "ts": "1438504348.003123"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "maybe when you downvote, it shows you a list of current top content, and lets you pick which one to send the money to.",
        "ts": "1438504356.003124"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "that's interesting.  That said, I think it could be used for other incentives by the system.  We should explore some of the ideas we spoke about in meta.  maybe table the downvote fund until then?",
        "ts": "1438504400.003125"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "sure, mainly I use that as a counter to people who try to marginalize opposition to taxation as pure greed when for a lot of people like myself it’s not really like that at all.",
        "ts": "1438504410.003126"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "interesting spin, if there are two posts competing for the same attention, then downvoting one upvotes the other...",
        "ts": "1438504424.003127"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "yeah i agree with that. no one seems to agree what to do about downvote money. it's a decision that can be made later.",
        "ts": "1438504424.003128"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "i'm with you 100%",
        "ts": "1438504436.003129"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U07GDL0H5>: why would you ever just straight upvote then?  if that were the case I’d start downvoting things just to upvote others and have more impact",
        "ts": "1438504451.003130"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "i like downvotes going to miner fees, or into DATT developer fund",
        "ts": "1438504452.003131"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "unless by convention we had the clients treat the effect of that upvote weaker somehow",
        "ts": "1438504476.003132"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "c_prompt suggest he charges 2 for a 1 downvote but a 1 for a 1 upvote... had some reasoning that seemed to make sense.",
        "ts": "1438504510.003133"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08ERPTQF>: then the DATT developers start taking up massive trolling as a hobby =D",
        "ts": "1438504519.003134"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "<@U07GDL0H5>: is there an interest in building DATT on Elements in order to benefit from Lightning?",
        "ts": "1438504523.003135"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "lol",
        "ts": "1438504531.003136"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "lol <@U08DD8LNP>",
        "ts": "1438504537.003137"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "at least DATT developers paying to downvote would get some of their money back",
        "ts": "1438504576.003138"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "paul_xbt: that's definitely an option. however elements is really intended to be a PoC, not necessarily something that would be the first production sidechain",
        "ts": "1438504601.003139"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "also, they use \"federated signing\" or something for the blocks, not PoW mining like bitcoin. it's not as decentralized as bitcoin.",
        "ts": "1438504629.003140"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "indeed Elements alpha is aptly named :wink:",
        "ts": "1438504645.003141"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "ok I got it, how about this as an ideal: downvote coins go to the hosting nodes",
        "ts": "1438504658.003142"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "for wasting their bandwidth and to thank them for hosting",
        "ts": "1438504671.003143"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "i like that too",
        "ts": "1438504683.003144"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "seems to have similar incentive problems ... incentivizes nodes to host bad content",
        "ts": "1438504685.003145"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "i can't figure out if that would be hard to do.  I think it might be self defeating too.",
        "ts": "1438504718.003146"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "after discussing this for an hour or so in SF, we got nowhere near consensus on what to do about it. i suggest we shelve the idea and wait until we have the software actually written and are in a position to actually decide what to do about it.",
        "ts": "1438504747.003147"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "agreed",
        "ts": "1438504760.003148"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "ryan, do you want to look through meta or have us highlight some of the more interesting ideas?",
        "ts": "1438504806.003149"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "we talked about a lot but that was all i could remember",
        "ts": "1438504819.003150"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "oh sorry you want me to look through that channel ... sure let me go do that",
        "ts": "1438504849.003151"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "sounds like a good plan punting on downvotes",
        "ts": "1438505076.003152"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "they aren’t even completely necessary to get something interesting running.  I don’t think digg ever had downvotes; but I do think a form of downvoting is desirable",
        "ts": "1438505104.003153"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "there is a certain sense of satisfaction I get from downvoting crap comments.  But I agree, not absolutely necessary.  Though we could build it and put in the logic and decide what to do with the loot later, before release but not hold on it.",
        "ts": "1438505178.003154"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "there's a lot of stuff that went on in <#C08FM0F6G> ... dunno how to easily summarize. lots of good points made in there.",
        "ts": "1438505190.003155"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "one of the biggest ideas to come out was the idea of nodes ‘subscribing’ to collectives to determine what content to host",
        "ts": "1438505215.003156"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i like the idea of users having the final say over what they view",
        "ts": "1438505252.003157"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "without subscriptions your hosting of content would be random and more ephemeral, but once you select a few collectives your hosting would focus on, and maybe even ONLY deal with hosting that content",
        "ts": "1438505255.003158"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "if they want to turn off a moderator and get the content anyway, sounds like a good idea to me",
        "ts": "1438505265.003159"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "I think that is one of our killer features",
        "ts": "1438505271.003160"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "yes, i think that's a good idea. you host the content you like\/want.",
        "ts": "1438505289.003161"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "the thing that differentiates us not only from reddit, but from voat or any other social aggregator ever built",
        "ts": "1438505290.003162"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "it would be good to sum up all the differentiators",
        "ts": "1438505595.003163"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "no traditional advertisements",
        "ts": "1438505794.003164"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "might be cool if politics.datt.bit resolved to the main politics node...",
        "ts": "1438505799.003165"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08E5P0BZ>: yeah that’s totally doable, the client app is just some static files on a web host you could easily have different copies pointing at different defaults",
        "ts": "1438505836.003166"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "that was one of the things I wanted to do with <http:\/\/snew.github.io> it’s reddit but with a totally different logged out front page",
        "ts": "1438505881.003167"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "that's interesting.  what do you mean by \"logged out\" front page?",
        "ts": "1438505937.003168"
    },
    {
        "type": "message",
        "user": "U08C22VNW",
        "text": "Would it make sense if voting and moderation were the same operation? If you’re considering ‘recognised voters’ to give people a custom view on the scores, then it seems you could just subscribe to the vote lists of particular users and aggregate them to get your moderated, ranked view of the content in a single community. Depending on a threshold you would essentially drop anything with sufficiently low score.",
        "ts": "1438505979.003169"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08E5P0BZ>: reddit has a set of default subreddits that make up the front page when you are logged out.",
        "ts": "1438506007.003170"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "when subreddits were first introduced they just showed <https:\/\/www.reddit.com\/r\/all> instead",
        "attachments": [
            {
                "service_name": "reddit",
                "title": "all subreddits • \/r\/all",
                "title_link": "https:\/\/www.reddit.com\/r\/all",
                "text": "reddit: the front page of the internet",
                "fallback": "reddit: all subreddits • \/r\/all",
                "thumb_url": "https:\/\/www.redditstatic.com\/icon.png",
                "from_url": "https:\/\/www.reddit.com\/r\/all",
                "thumb_width": 256,
                "thumb_height": 256,
                "id": 1
            }
        ],
        "ts": "1438506027.003171"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "yes, we spoke about that - could be like choose your mod or combination of mods",
        "ts": "1438506029.003173"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "<@U08DD8LNP>: I didn't even realize that.  I'm always logged in!",
        "ts": "1438506049.003174"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i'm going to do a little bit of programming, then head off to bed ... see you guys tomorrow",
        "ts": "1438507376.003175"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "cya tomorrow <@U07GDL0H5>",
        "ts": "1438507610.003176"
    },
    {
        "user": "U08FSH97D",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FSH97D|matan.field> has joined the channel",
        "ts": "1438524252.003179"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "Hi all, exciting to see all this movement,  will try to get into paste.  Quickly on myself, a theoretical physicist and founder of LaZooz (<http:\/\/lazooz.org>) and Backfeed (<http:\/\/backfeed.cc>) , have spent the last year on designing protocols for decentralized interactions of any kind and the according distribution of value and reputation among collaborators, in a fraud-resilient and scalable way.  Would love to be part of the party! <@U07GDL0H5>",
        "attachments": [
            {
                "text": "This is LaZooz community public website",
                "fallback": "This is LaZooz community public website",
                "from_url": "http:\/\/lazooz.org",
                "id": 1
            }
        ],
        "ts": "1438525192.003180"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "<@U08FSH97D>: seems like a really great fit.  I look forward to reading about your ideas, and trying to wrap my head around them.",
        "ts": "1438525949.003182"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "Thanks <@U08E5P0BZ>.  The protocol we've build allows one (in a general setup) submit any contribution (in this case, a new piece of content),   evaluate contributions (here,  the uploaded content);  contributors earn tokens and reputation according to the collective assessment;  evaluators gain (or loose) reputation in the process as well;  the tagging (semantic) structure is part of the process;   it's all 100% proof from all sort of attacks, Sybil, collusion, and other spam;   generally leading to a *diversity* of *aligned* groups;  etc.",
        "ts": "1438526650.003183"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "The tokens are then being used to purchase the service (here, reading high-quality, community-moderated content);    there's the economic-business model behind, and so on.",
        "ts": "1438526735.003184"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "we're working now on a technical description of the whole thing",
        "ts": "1438526746.003185"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "I haven't read the all thread, so not sure where we stand with all this here, but if you'd be interested, we can deliver the whole protocol from bottom to end,  it's also already implemented in code.",
        "ts": "1438526821.003186"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "and of course, eventually all that sits on the blockchain",
        "ts": "1438526881.003187"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "I have to run now, but would be happy to continue the discussion later...   in particular, where we stand, what's missing and how I can help. Very exciting project!",
        "edited": {
            "user": "U08FSH97D",
            "ts": "1438527036.000000"
        },
        "ts": "1438527002.003188"
    },
    {
        "type": "message",
        "user": "U08CG8V89",
        "text": "just catching up... i agree with <@U08DD8LNP> that rewarding submitters for downvotes is a bad idea. a downvote is an expression of negativity and, thus, a lack of or removal of value. philosophically, that sends a very bad message - that a submitter is rewarded even when they don't add value or remove\/destroy value. to suggest an alternative, on valME, a downvote not only removes 1 karma (USD $0.01) from the OP but it also costs 2 karma (USD $0.02) to downvote. the total 3 karma (USD $0.03) goes to valME which can then be reinvested into supporting the communities. in datt, the $0.03 could go into a pool that funds contests not dissimilar to what <@U08E5P0BZ> suggested (e.g., most upvoted posts, highest quantity submitters) across communities or reduce fees temporarily for a community until the pool was empty. from <http:\/\/valme.io\/c\/gettingstarted\/faq\/nqqqs\/why-does-it-cost-1-karma-to-upvote-but-2-to-downvote>:\n\n\"One of the problems with downvoting is that it’s quite easy to censor someone’s content if you just want to be a troublemaker (aka troll). Don’t like what a particular political candidate has to say? Downvote it. After all, there isn’t any cost to do so. Additionally, it’s somewhat easy to create “bots” that will automatically upvote or downvote content.\n\nAs a result, people can severely limit and\/or manipulate what is seen by others without any cost to themselves. It can also negatively impact a content provider’s reputation. We think that’s a problem. Although we agree all content does not offer the same value, we want to discourage activities like “downvote brigades” that you see so often at places like reddit.\n\nWhen you downvote content, it costs you two karma and the author one karma (1 karma = USD $0.01). As there is a cost, we expect this to significantly reduce behaviors like downvote brigades. We’re all for voicing your negative opinion on something, and that’s how downvotes are intended. But, as your actions cause the author to lose something of value (e.g. karma, reputation), we want you to feel strongly enough about it. In other words, we require you to put your money where your mouth is – and where your values are. If you’re not willing to do that, it must not be that important to you. Best then to just leave the other person alone and go your separate way.\"",
        "attachments": [
            {
                "text": "FAQ - 'nuff said | valME. Put value in. Get value out.",
                "fallback": "FAQ - 'nuff said | valME. Put value in. Get value out.",
                "from_url": "http:\/\/valme.io\/c\/gettingstarted\/faq\/nqqqs\/why-does-it-cost-1-karma-to-upvote-but-2-to-downvote",
                "id": 1
            }
        ],
        "ts": "1438530980.003190"
    },
    {
        "user": "U08FTT15M",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FTT15M|sujatamenon> has joined the channel",
        "ts": "1438531002.003192"
    },
    {
        "type": "message",
        "user": "U08CG8V89",
        "text": "one other thing to consider: i built the ability for moderators to create custom-defined karma types and each post can have up to 7. (to see how it works, click the \"show\" link on any valME post between the voting arrows.) so, for example, posts in a community could have moderator-defined votes for \"intelligent,\" \"agree\", \"funny,\" etc. this way, a community is able to express more specifically the kind of value they received (or didn't) from content (or the kinds of values for which the community is based and expectations about contributions). this then serves a useful purpose of being able to rank, for example, the communities with \"more intelligent\" content from the community with \"funnier\" content from the community with the \"least intelligent\" content. it also allows you to do the same regarding users (e.g., who is submitting the most intelligent content). doing this also allows users (i.e., the market) to express their dissatisfaction with certain communities (e.g., \/r\/fatpeoplehate) by putting their money where their mouths are. in theory, you could even then cause the submission price of a community to automatically go up as the downvotes increased or down as the upvotes increased, thus making it more costly for communities that don't add value to participate or less costly for communities that do. multiple customized karma types also allows for community efforts to do things like commit to a project (<http:\/\/valme.io\/c\/gettingstarted\/faq\/cqqqs\/whats-a-project>):\n\n\"We’ve provided functionality allowing you to submit a “project” post, which gives you two capabilities: an additional karma type called “commit” and a way to send messages to everyone who commits.\n\nFor example, let’s say you’re really upset about the NSA destroying people’s civil liberties, and you want to organize a protest march in front of their offices. (Although finding their offices may be problematic, considering how secretive they are. But we digress...) You can submit a post titled “Stare down the NSA! Come join our protest against these fiends!” Checking the project box will put [PROJECT] in the title. Additionally, when members vote, they will see the karma type commit. By upvoting commit, they are indicating their plans to participate in the cause. The post author can then click on a link within the post to message all members who committed to the project. This allows the author to communicate directly with only participating members.\"",
        "ts": "1438531044.003193"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "managed to wake up after only 3-4 hrs of sleep ... normal sleeping schedule begins today :simple_smile:",
        "ts": "1438537421.003194"
    },
    {
        "user": "U08FVLJR4",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FVLJR4|akshithg> has joined the channel",
        "ts": "1438538436.003195"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "welcome <@U08FSH97D> !",
        "ts": "1438538591.003196"
    },
    {
        "type": "message",
        "user": "U08FSH97D",
        "text": "Thanks Ryan! pleasure to be around :simple_smile:",
        "ts": "1438539326.003197"
    },
    {
        "user": "U08FW063C",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FW063C|jordan> has joined the channel",
        "ts": "1438539532.003198"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Hey guys, I'm dropping in late and in the context of a ton of flow.  I apologize if my contributions are off topic or redundant.  My first contribution is my thinking in the abstract about the general problems that need to be solved by something like a \"decentralized reddit\".  I also have thoughts on some of the more specific issues (like business model, relationship between downvotes and economics, etc. but that will have to wait.)",
        "ts": "1438542275.003199"
    },
    {
        "type": "message",
        "subtype": "file_share",
        "text": "<@U08FW063C|jordan> uploaded a file: <https:\/\/dattnetwork.slack.com\/files\/jordan\/F08FWJ12L\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt|High Level Consideration of Reddit as a Decentralized Organication>",
        "file": {
            "id": "F08FWJ12L",
            "created": 1438542519,
            "timestamp": 1438542519,
            "name": "High_Level_Consideration_of_Reddit_as_a_Decentralized_Organication.txt",
            "title": "High Level Consideration of Reddit as a Decentralized Organication",
            "mimetype": "text\/plain",
            "filetype": "text",
            "pretty_type": "Plain Text",
            "user": "U08FW063C",
            "editable": true,
            "size": 4164,
            "mode": "snippet",
            "is_external": false,
            "external_type": "",
            "is_public": true,
            "public_url_shared": false,
            "display_as_bot": false,
            "username": "",
            "url": "https:\/\/slack-files.com\/files-pub\/T07GDKW3U-F08FWJ12L-48349c6364\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt",
            "url_download": "https:\/\/slack-files.com\/files-pub\/T07GDKW3U-F08FWJ12L-48349c6364\/download\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt",
            "url_private": "https:\/\/files.slack.com\/files-pri\/T07GDKW3U-F08FWJ12L\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt",
            "url_private_download": "https:\/\/files.slack.com\/files-pri\/T07GDKW3U-F08FWJ12L\/download\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt",
            "permalink": "https:\/\/dattnetwork.slack.com\/files\/jordan\/F08FWJ12L\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt",
            "permalink_public": "https:\/\/slack-files.com\/T07GDKW3U-F08FWJ12L-48349c6364",
            "edit_link": "https:\/\/dattnetwork.slack.com\/files\/jordan\/F08FWJ12L\/high_level_consideration_of_reddit_as_a_decentralized_organication.txt\/edit",
            "preview": "The construction of any DCO must fully consider the diverse value-creation modes that generate its homeostasis.  \n\nIn the case of Reddit, there are several:\n\n* The creation, maintenance and improvement of the software code that \"is\" the platform.  \n\n* The operation and maintenance of the hardware system that provides service.\n\n[Both of these are typically bundled under the term \"Admin\"]\n",
            "preview_highlight": "<div class=\"sssh-code\"><div class=\"sssh-line\"><pre>The construction of any DCO must fully consider the diverse value-creation modes that generate its homeostasis.  \r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>In the case of Reddit, there are several:\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>* The creation, maintenance and improvement of the software code that &quot;is&quot; the platform.  \r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>* The operation and maintenance of the hardware system that provides service.\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>[Both of these are typically bundled under the term &quot;Admin&quot;]\r<\/pre><\/div>\n<div class=\"sssh-line\"><pre>\r<\/pre><\/div>\n<\/div>",
            "lines": 51,
            "lines_more": 41,
            "channels": [
                "C07GDL0Q7"
            ],
            "groups": [],
            "ims": [],
            "comments_count": 0
        },
        "user": "U08FW063C",
        "upload": true,
        "display_as_bot": false,
        "username": "<@U08FW063C|jordan>",
        "bot_id": null,
        "ts": "1438542519.003200"
    },
    {
        "user": "U08FWU9ST",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FWU9ST|primavera> has joined the channel",
        "ts": "1438543831.003201"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "<@U08FW063C> we are still a bit stuck here: if each vote costs $0.01, and you downvote someone, where does that money go?",
        "ts": "1438544035.003202"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "Hi <@U08FW063C> - very interesting, we haven't discussed a DCO perspective, but it's certainly possible that network participants (primarily Mods &amp; Nodes) could exist as profitable DCOs ",
        "ts": "1438544063.003203"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<https:\/\/en.wikipedia.org\/wiki\/Decentralized_autonomous_organization>",
        "ts": "1438544659.003204"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "We have discussed a few options for where the downvote money goes 1) To the content provider (not preferable in my opinion) 2) To the subreddit that the content provider posted on (not preferable in my opinion, rewarding the subreddit for bad content) 3) Into a lottery that gets distributed to users (could distract users from the core purpose of Reddit and encourage Sybil attacks) 4) Distributed to other subreddits that are perhaps doing a better job of attracting good content providers 5) Burnt (e.g. proof of burn)",
        "ts": "1438544686.003205"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "My preference would be 4) but there isn't consensus here",
        "ts": "1438544788.003206"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "last night <@U07GDL0H5> added 6) Sent as miner fees (essentially burning but it benefits the blockchain)",
        "ts": "1438545136.003207"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "<@U08FELGRX>:  All money should to to a general account which should then be reallocated to core functions (admin, mods, OC, OP, OC) according to some defined method.",
        "ts": "1438545183.003208"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "I was also thinking about 7) locked in a transaction that will return to me after n-locktime - this way I don't waste downvotes but it also doesn't benefit anyone else.",
        "ts": "1438545233.003209"
    },
    {
        "type": "message",
        "user": "U08F2RTCN",
        "text": "<@U08FW063C>, will the funds from the General Account be some kind of escrow to hold until its been settled across all parties?, Can't it be done right away?",
        "ts": "1438545337.003210"
    },
    {
        "type": "message",
        "user": "U08C9ML1Y",
        "text": "liking 7)",
        "ts": "1438547151.003211"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": ":sunglasses: User picks an account of their choosing. I'd like to donate to EFF for downvoting some things lol",
        "ts": "1438547448.003212"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "'8 )'",
        "ts": "1438547457.003213"
    },
    {
        "type": "message",
        "user": "U08C9ML1Y",
        "text": "that option could be gameable",
        "ts": "1438547561.003214"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "Yea, it could lead to a loop of downvotes.",
        "ts": "1438547612.003215"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "<@U08F2RTCN>: it can be done continuously or episodically.  Different goods\/bads in either approach.",
        "ts": "1438547802.003216"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "the lock-time is a decent idea, it could even go into a 2-of-2 multisig where if the post is deemed to be a repost\/troll\/shitpost and gets removed everyone who downvoted gets their money back. Might incentivize people to downvote only if the content is objectionable\/bad quality",
        "ts": "1438547819.003217"
    },
    {
        "type": "message",
        "user": "U08F2RTCN",
        "text": "<@U08FW063C>: got it",
        "ts": "1438547859.003218"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "I think it's interesting to consider the implications of allowing variable upvote\/down vote amounts.  You could express magnitude instead of just direction.",
        "ts": "1438548573.003219"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "You could promote content like with bounties but you could also express vehement disagreement\/opposition.  Some might say it's not democratic, but it is economic and the authors would potentially make more out of the gate before the platform reaches higher adoption. ",
        "ts": "1438548869.003220"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "<@U08E5P0BZ>: I think that would further complicate the voting, and encourage people to downvote good things into oblivion just cause they feel like it",
        "ts": "1438549156.003221"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "But they have to pay. ",
        "ts": "1438549240.003222"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "so that means rich people's opinions are stronger than poor people's",
        "ts": "1438549745.003223"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "or paid shills",
        "ts": "1438549760.003224"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "not very equitable",
        "ts": "1438549808.003225"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "<@U08FELGRX>: yes, I would strongly counsel not to cross the streams - the primary value proposition of something like this is high signal.  This should not be mixed with any sort of direct monetization.",
        "ts": "1438550699.003226"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Signal - i.e., where I should allocate my attention to get an optimal use of my fundamentally scarce life",
        "ts": "1438550731.003227"
    },
    {
        "type": "message",
        "user": "U08CG8V89",
        "text": "\"cross the stream\" - <https:\/\/www.youtube.com\/watch?v=jyaLZHiJJnE>",
        "attachments": [
            {
                "service_name": "YouTube",
                "service_url": "https:\/\/www.youtube.com\/",
                "title": "Cross the streams",
                "title_link": "https:\/\/www.youtube.com\/watch?v=jyaLZHiJJnE",
                "author_name": "doctoroctos",
                "author_link": "https:\/\/www.youtube.com\/user\/doctoroctos",
                "thumb_url": "https:\/\/i.ytimg.com\/vi\/jyaLZHiJJnE\/hqdefault.jpg",
                "thumb_width": 480,
                "thumb_height": 360,
                "fallback": "YouTube Video: Cross the streams",
                "video_html": "<iframe width=\"400\" height=\"225\" src=\"https:\/\/www.youtube.com\/embed\/jyaLZHiJJnE?feature=oembed\" frameborder=\"0\" allowfullscreen><\/iframe>",
                "video_html_width": 400,
                "video_html_height": 225,
                "from_url": "https:\/\/www.youtube.com\/watch?v=jyaLZHiJJnE",
                "id": 1
            }
        ],
        "ts": "1438550774.003228"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "The methods of identifying signal should be influenced *only* by \"good signal\"",
        "ts": "1438550776.003230"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Monetization can and should be handled by different components.",
        "ts": "1438550789.003231"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "For example.  Using the Backfeed protocols as I understand them (@matan can do a much better job than I here), you might have an \"attention-worthy\" token that is allocated by any\/all users to the content that they deem attention-worthy.  The Backfeed algorithms would then take in all of this information and return an \"attention-worthy\" value for each piece of content (equivalent to but more precise than the \"net upvote\" score at Reddit).  It would also return a \"reputation\" score to each user - indicating how good they are at \"curating\" or \"identifying attention-worthy\" content.",
        "ts": "1438550914.003232"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Separately, taking a look at monetization",
        "ts": "1438550941.003233"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "The key here is to start at the top (what I call \"the whole\") and make sure that everyone is incentivized to maintain the integrity of and increase the value of the whole - while contributing their value to a wide variety of different specific aspects of the whole.",
        "ts": "1438550984.003234"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Using my text snippet above, for example, we might say that there are seven discrete value-creation activities that we want to reward: software dev, sysadmin, mods, OP, curators, Comments and OC).  There are many different ways to value and allocate value to these different activities.  Broadly, you can use objective or subjective valuations.",
        "ts": "1438551089.003235"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "An objective valuation is based on an objectively measurable metric: how many people read your post, how many subscribers in a sub, etc.",
        "ts": "1438551141.003236"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "A subjective valuation is based on some collection of individual people's values - rendered objective by some metric (5 star rating, 100% rating, upvotes, etc.)",
        "ts": "1438551197.003237"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "One model would be to slice \"the whole\" of Datt (nice name by the way) into seven big picture slices based on how much value we think each activity broadly contributes to the whole.  E.g., software dev is 8% of the whole, OP is 25%, mods are 20%, etc.)",
        "ts": "1438551283.003238"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "All incoming revenue is apportioned to these activity-pools and then allocated to individuals using some method that is appropriate to the sub-domain.",
        "ts": "1438551321.003239"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Looping to the top, you might allocate 25% of all value to OP and then on a weekly (daily, hourly, etc.) basis allocate that fraction to OP content based on their \"attention-worthy\" score.",
        "ts": "1438551401.003240"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "This is just an example.  There are many ways to approach this problem.",
        "ts": "1438551412.003241"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Key Message: don't cross the streams! :wink:",
        "ts": "1438551423.003242"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "<@U08FELGRX> remember they are paying someone as in supporting soneonr.  So paying for influence and suooort.  That happens anyway.  I don't have strong feelings.  It was more of a proposition.  We had also disused a pattern model too where this may make sense. ",
        "ts": "1438552999.003243"
    },
    {
        "type": "message",
        "user": "U08E5P0BZ",
        "text": "Just an idea.  I think it's unique so seemed like something to entertain at least for exploration. ",
        "ts": "1438553954.003244"
    },
    {
        "type": "message",
        "user": "U08FELGRX",
        "text": "I see. I think it's a slippery slope as soon as you allow someone to \"buy\" support, it kind of invites ulterior motives. So maybe implementing diminishing scales of return could dissuade people from that",
        "ts": "1438553990.003245"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "I like the idea of better rewarding an early voter who accurately predicts how the group as a whole will react versus someone who just piles on later after the majority of people have spoken. Although a system like that might encourage people to vote how they think everyone else will feel, and not necessarily how they really feel themselves.",
        "ts": "1438555475.003246"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "Assuming all subreddits are autonomous entities in their own right, we don't need to enforce our preferences. However, yesterday we agreed that the best solution was to have a fixed fee for an upvote or downvote in addition to a ChangeTip like feature so one is able to reward good content providers on top of the upvote fixed fee",
        "ts": "1438555888.003247"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "I suspect buying influence such as being able to upvote more than once would be unpopular and against most users' perceptions of a democratic process",
        "ts": "1438556035.003248"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "<@U08DN0E5S> Yeah that sounds more like an Augur prediction market on how the crowd will respond rather than an accurate representation of the crowd's feedback",
        "ts": "1438556216.003249"
    },
    {
        "type": "message",
        "user": "U08DFAGBW",
        "text": "<@U08DN0E5S>: That reminds me of auger. And the whole idea of crowd mentality tending to be more accurate that a particular persons opinion",
        "ts": "1438556238.003250"
    },
    {
        "type": "message",
        "user": "U08DFAGBW",
        "text": "Than*",
        "ts": "1438556246.003251"
    },
    {
        "type": "message",
        "user": "U08DFAGBW",
        "text": "Also the idea mentioned earlier of being able to have a few diff up votes makes sense (similar to how the gaming community rooster teeth has a drop down and \"+1 ditto\" is one of them",
        "ts": "1438556334.003252"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "Just floating ideas, but what do you imagine would happen if the price of voting decreased the more votes there are? If votes cost money, would people not bother to vote if the thing they like already has a lot of votes? Or do we think people would pitch in regardless, because they want their voice heard?",
        "edited": {
            "user": "U08DN0E5S",
            "ts": "1438556487.000000"
        },
        "ts": "1438556462.003253"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "Or would it also make people think twice about being the first to vote, because they know it would cost them extra...",
        "ts": "1438556526.003255"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "Check out how much Reddit is making from users gifting each other worthless Reddit gold.... <https:\/\/www.reddit.com\/gilding>",
        "attachments": [
            {
                "text": "reddit: the front page of the internet",
                "fallback": "reddit: the front page of the internet",
                "from_url": "https:\/\/www.reddit.com\/gilding",
                "id": 1
            }
        ],
        "ts": "1438556608.003256"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "There would be less votes but there is a big market out there for people who are willing to reward others even if in the Reddit example they are only enriching Reddit",
        "ts": "1438556675.003258"
    },
    {
        "type": "message",
        "user": "U08CG8V89",
        "text": "<@U08F35H0V>: what if you allowed the OP to upvote his post once (so effectively you start at zero) but the cost of that self-promotion upvote went to node operators?",
        "edited": {
            "user": "U08CG8V89",
            "ts": "1438556929.000000"
        },
        "ts": "1438556722.003259"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "FWIW, i'll just throw out there that at a technical level, it would be easier to implement the equivalent of \"gilding\" with bitcoin beacause with $5 payments we wouldn't need the lightning network, and upvotes\/downvotes wouldn't cost any bitcoin",
        "ts": "1438556776.003260"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "with upvoting\/downvoting being bitcoin payments, or presumably any other decentralized solution, the technical details are a lot harder to minimize transaction fees",
        "ts": "1438556808.003261"
    },
    {
        "type": "message",
        "user": "U08F35H0V",
        "text": "At a technical level it would be easier to keep Reddit as is and to just replace gilding with a ChangeTip button. Next easiest is to implement Bitcoin tipping without using ChangeTip.",
        "ts": "1438557094.003263"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "Again, not sure if this has been discussed before, but what about preventing “voter fraud”? Reddit does it with algorithms in an attempt to prevent accounts run by bots from burying or hyping stories. This could be prevented by charging per vote (fraud could still be committed, but it would be much more expensive)",
        "ts": "1438557179.003264"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "(I’m pretty sure I did see this mentioned somewhere over the past 2 days…)",
        "ts": "1438557210.003265"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "Also, someone could post a story, hype it with tons of fake accounts, and if the cost of votes go to the content creator, they’d just get their money back. Free advertising in social media’s clothing.",
        "edited": {
            "user": "U08DN0E5S",
            "ts": "1438557308.000000"
        },
        "ts": "1438557292.003266"
    },
    {
        "type": "message",
        "user": "U08DN0E5S",
        "text": "Maybe it’s a problem for later down the pipeline",
        "ts": "1438557331.003268"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "ha yes of course <@U08F35H0V> :simple_smile:",
        "ts": "1438557451.003269"
    }
]