[
    {
        "user": "U08C22VNW",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08C22VNW|mhouston> has joined the channel",
        "ts": "1438519936.000295"
    },
    {
        "user": "U08FSH97D",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FSH97D|matan.field> has joined the channel",
        "ts": "1438524307.000296"
    },
    {
        "user": "U08FVLJR4",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FVLJR4|akshithg> has joined the channel",
        "ts": "1438540443.000297"
    },
    {
        "user": "U08CG8V89",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08CG8V89|c_prompt> has joined the channel",
        "ts": "1438541536.000298"
    },
    {
        "user": "U08FW063C",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FW063C|jordan> has joined the channel",
        "ts": "1438542796.000299"
    },
    {
        "user": "U08FWU9ST",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08FWU9ST|primavera> has joined the channel",
        "ts": "1438544262.000300"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "Maybe later tonight we can discuss the origins of the need for privacy, and whether there exists a human drive for it at all :simple_smile:",
        "ts": "1438548149.000301"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "<@U08EZP01H>: It's a different spectrum for every individual no? Freedom of expression sometimes blurs the line on a desire for privacy, but they're not mutually exclusive. If I sit high on freedom and high on privacy, it's probably because my views are dissenting of power. If I sit low on both, then it's probably because lolcatz",
        "ts": "1438549017.000302"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "Yea, it's often about where that handoff is. I was trying to get even more meta though... I've been toying with a blog about whether our desire for privacy is actually just our fear of the unknown\/less possible choices",
        "ts": "1438549158.000303"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "It just seems obvious that when we talk about privacy we're really talking about safety.",
        "ts": "1438549196.000304"
    },
    {
        "type": "message",
        "user": "U08ERPTQF",
        "text": "I need a :coffee: before I can go that deep man :wink:",
        "ts": "1438549206.000305"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "Maybe I had 1 too many.",
        "ts": "1438549238.000306"
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "\"Our society is increasingly relying on the digitized, aggregated opinions of others to make decisions. We therefore designed and analyzed a large-scale randomized experiment on a social news aggregation Web site to investigate whether knowledge of such aggregates distorts decision-making.\" <http:\/\/www.sciencemag.org\/content\/341\/6146\/647.abstract>",
        "ts": "1438549516.000307",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U08ERPTQF"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U08EZP01H",
        "text": "2013 study on voting mechanism and herding",
        "ts": "1438549540.000308"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "Privacy will naturally erode to a degree as global communications improve, but the ability to speak anonymously is something important to preserve IMO.  <https:\/\/en.wikipedia.org\/wiki\/The_Federalist_Papers>",
        "ts": "1438551414.000309"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "What is the process and approach to Mods?  \n1.  Mods are extremely important - this can't be punted.  This is a separate and much more challening function than curation.\n2.  Mods need to be in a position to ban users.  Yet this position must also be prevented from being used to control the conversation or extract value.",
        "ts": "1438551769.000310"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08FW063C>: <http:\/\/go1dfish.me\/blog\/crypto-anarchy-social-aggregator-bitcoin-world-wide-ledger>  See collectives you could expand the idea to user filtering as well",
        "ts": "1438551810.000311"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "Thanks",
        "ts": "1438552067.000312"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "In a separate effort with a similar intent, we settled on the solution that identity by default should be non-anonymous, but that there should be the ability to generate both pseudo-anonymity and real anonymity for specific sub-communities.",
        "ts": "1438552167.000313"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "<@U08DD8LNP>: IMHO, the Mod function provides a very wide array of values in addition to \"pruning the conversation\".  I think of it more like a host in a good salon - they frame the UI, the presence-absence of a wiki (or other features), the tone through policies and voice, etc.  Who gets to be a Mod, what they can do in general and then how they are themselves held accountable is where I'm most intrigued.",
        "ts": "1438552398.000314"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "We are envisioning a network comprised of diverse clients.  UI control is not really an option, all those other policies are effectively filtering preferences",
        "ts": "1438552475.000315"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "I take it that from your model, the version of a sub-community that I would see would be the \"sum\" of those comments not modded out by the individuals who I've chosen personally to \"follow\" as mods?  Thats a neat approach.",
        "ts": "1438552480.000316"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "How does the community make their community look and feel like a place they want to be?",
        "ts": "1438552506.000317"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "<@U08FW063C>: yeah pretty much, there is a very basic demo of the idea here: <http:\/\/dattnetwork.github.io\/#\/c\/1NHy1SqQSeyEopKv3v1iTfx7sFdEiqocWb>",
        "ts": "1438552522.000318"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "This might work nicely.  If you coupled it with a reward scheme for every user who is following a given \"mod\" you might find yourself with a large community of very good and very respected mods.",
        "ts": "1438552581.000319"
    },
    {
        "type": "message",
        "user": "U08CG8V89",
        "text": "<@U08FW063C>: ideas from valME... mods can ban users for eternity or a set timeframe from posting (editorials and\/or links) and\/or commenting. additionally, if mods set the community up as private, they can only let certain users view. also, mods can ban domains or limit the number of links from a certain domain that can be submitted daily (across all users)",
        "ts": "1438552582.000320"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "in this model a community is the sum of the content, and I agree that it’s not as strong of a community model as the subreddit model and that’s why I call them collectives to differentiate that.  It’s more about curation than trying to foster separate communities but they have a lot of similarity",
        "ts": "1438552585.000321",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U08ERPTQF"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "So, no semantic separation?  Tricky.  IMHO, a big chunk of the value prop of reddit is the \"feeling of community\"",
        "ts": "1438552744.000322"
    },
    {
        "type": "message",
        "user": "U08FW063C",
        "text": "(Thanks for bringing me up to speed, by the way)",
        "ts": "1438552768.000323"
    },
    {
        "type": "message",
        "user": "U08DD8LNP",
        "text": "These are just my ideas btw, but they do seem to have fairly wide support here, it’s not the only way to do things",
        "ts": "1438552842.000324",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U08FW063C"
                ],
                "count": 1
            }
        ]
    },
    {
        "user": "U08G10908",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08G10908|christophera> has joined the channel",
        "ts": "1438560953.000325"
    }
]