[
    {
        "type": "message",
        "user": "U08C22VNW",
        "text": "If you have moderated lists of content hashes that should be filtered out for a variety of reasons, eg. “Illegal in China”, “Copyright violation”, etc, you could set up your node to filter it out. It would be the same as the moderation lists discussed elsewhere, except presumably double-hashed to avoid people using the ban list as a directory. I’m not sure who you would trust to moderate illegal content though: moderating something implies that you had access to it at some point, since filtering just by the metadata would be simple to work around for determined individuals. Anonymity might be required to protect the moderator from legal repercussions, despite their intent.",
        "ts": "1438694736.000032"
    },
    {
        "type": "message",
        "user": "U08DDG1SB",
        "text": "we had this discussion for many months at OpenBazaar about this very same topic and we decided that we would allow users to push encoded content to any nodes and if there was a need to have some kind of net nanny on the network that someone could build that service and provide  it as an opt-in capability. Considering there is CP in the bitcoin blockchain I’m not that concerned that LE will be diving into heavily obfuscated data stores to find this stuff unless it becomes a big problem. At that point maybe one of these solutions will have come to be and you can do some optional filtering. I think you’re sending yourself down a rat hole if you try to do it yourself.",
        "ts": "1438696433.000033"
    },
    {
        "type": "message",
        "user": "U08DDG1SB",
        "text": "if you give users the ability to tag content as NSFW or whatever as well then you can proactively filter that content easily as another option. then you’re only dealing with truly malicious users trying to get around the system or mess with the network.",
        "ts": "1438696515.000034"
    },
    {
        "user": "U08F31MGX",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08F31MGX|fractaloop> has joined the channel",
        "ts": "1438702087.000035"
    },
    {
        "type": "message",
        "user": "U07GDL0H5",
        "text": "i just posted a (obviously not very well-thought out) database structure here: <https:\/\/github.com\/dattnetwork\/dattdocs\/blob\/master\/database.md>",
        "attachments": [
            {
                "service_name": "GitHub",
                "title": "dattnetwork\/dattdocs",
                "title_link": "https:\/\/github.com\/dattnetwork\/dattdocs\/blob\/master\/database.md",
                "text": "dattdocs - Document all the things.",
                "fallback": "GitHub: dattnetwork\/dattdocs",
                "thumb_url": "https:\/\/avatars0.githubusercontent.com\/u\/13266895?v=3&s=400",
                "from_url": "https:\/\/github.com\/dattnetwork\/dattdocs\/blob\/master\/database.md",
                "thumb_width": 214,
                "thumb_height": 214,
                "id": 1
            }
        ],
        "ts": "1438753963.000036"
    },
    {
        "user": "U08F438SK",
        "type": "message",
        "subtype": "channel_join",
        "text": "<@U08F438SK|willy> has joined the channel",
        "ts": "1438754036.000038"
    }
]